## Dataset 120 years of Olympic history: Athletes and result
1. **Menampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka**

In [18]:
import pandas as pd

# Load dataset
dataFrame = pd.read_csv('athlete_events.csv')


# untuk menampilkan statistik deskriptif
statistics = dataFrame.describe()

# Hapus baris "count"
statistics = statistics.drop('count')

# Tampilkan hasil
print(statistics)

                 ID        Age      Height      Weight         Year
mean   68248.954396  25.556898  175.338970   70.702393  1978.378480
std    39022.286345   6.393561   10.518462   14.348020    29.877632
min        1.000000  10.000000  127.000000   25.000000  1896.000000
25%    34643.000000  21.000000  168.000000   60.000000  1960.000000
50%    68205.000000  24.000000  175.000000   70.000000  1988.000000
75%   102097.250000  28.000000  183.000000   79.000000  2002.000000
max   135571.000000  97.000000  226.000000  214.000000  2016.000000

2. **Tampilkan 10 record pertama dari dataset dengan attribute bertipe angka**

In [17]:
# Filter hanya kolom bertipe angka
dataFrame = dataFrame.select_dtypes(include=['number'])

# Tampilkan 10 record pertama
dataFrame.head(10)

   ID   Age  Height  Weight  Year
0   1  24.0   180.0    80.0  1992
1   2  23.0   170.0    60.0  2012
2   3  24.0     NaN     NaN  1920
3   4  34.0     NaN     NaN  1900
4   5  21.0   185.0    82.0  1988
5   5  21.0   185.0    82.0  1988
6   5  25.0   185.0    82.0  1992
7   5  25.0   185.0    82.0  1992
8   5  27.0   185.0    82.0  1994
9   5  27.0   185.0    82.0  1994

3. **Mampilkan informasi jumlah record, jumlah attribute, nama attribute, jumlah attribute dengan tipe angka**

In [21]:
# Jumlah record
num_records = len(dataFrame)

# Jumlah atribut
num_attributes = len(dataFrame.columns)

# Nama atribut
attribute_names = dataFrame.columns.tolist()

# Jumlah atribut dengan tipe angka
numeric_attributes = len(dataFrame.select_dtypes(include=['number']).columns)

# Membuat dictionary
info_dict = {
    'Jumlah Record': num_records,
    'Jumlah Attribute': num_attributes,
    'Nama Attribute': attribute_names,
    'Jumlah Attribute dengan Tipe Angka': numeric_attributes
}

# Menampilkan isi dictionary
for key, value in info_dict.items():
    print(f"{key}: {value}")

Jumlah Record: 271116
Jumlah Attribute: 15
Nama Attribute: ['ID', 'Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'NOC', 'Games', 'Year', 'Season', 'City', 'Sport', 'Event', 'Medal']
Jumlah Attribute dengan Tipe Angka: 5

4. **Mampilkan nilai dataset pada baris dimulai dengan 3 digit NIM akhir hingga data terakhir dan kolom ke 4 hingga kolom terakhir menggunakan ke 2 metode slice**

In [22]:
# 1. Menggunakan loc untuk slicing
subset_loc = dataFrame.loc[140:, dataFrame.columns[4]:]

print(subset_loc)

        Height  Weight      Team  NOC        Games  Year  Season  \
140      167.0    64.0     Spain  ESP  2016 Summer  2016  Summer
141      167.0    64.0     Spain  ESP  2016 Summer  2016  Summer
142      167.0    64.0     Spain  ESP  2016 Summer  2016  Summer
143      167.0    64.0     Spain  ESP  2016 Summer  2016  Summer
144      167.0    64.0     Spain  ESP  2016 Summer  2016  Summer
...        ...     ...       ...  ...          ...   ...     ...
271111   179.0    89.0  Poland-1  POL  1976 Winter  1976  Winter
271112   176.0    59.0    Poland  POL  2014 Winter  2014  Winter
271113   176.0    59.0    Poland  POL  2014 Winter  2014  Winter
271114   185.0    96.0    Poland  POL  1998 Winter  1998  Winter
271115   185.0    96.0    Poland  POL  2002 Winter  2002  Winter

                  City        Sport                                     Event  \
140     Rio de Janeiro   Gymnastics           Gymnastics Men's Floor Exercise
141     Rio de Janeiro   Gymnastics            Gymnastics Men's Parallel Bars
142     Rio de Janeiro   Gymnastics           Gymnastics Men's Horizontal Bar
143     Rio de Janeiro   Gymnastics                    Gymnastics Men's Rings
144     Rio de Janeiro   Gymnastics          Gymnastics Men's Pommelled Horse
...                ...          ...                                       ...
271111       Innsbruck         Luge                Luge Mixed (Men)'s Doubles
271112           Sochi  Ski Jumping  Ski Jumping Men's Large Hill, Individual
271113           Sochi  Ski Jumping        Ski Jumping Men's Large Hill, Team
271114          Nagano    Bobsleigh                      Bobsleigh Men's Four
271115  Salt Lake City    Bobsleigh                      Bobsleigh Men's Four

       Medal
140      NaN
141      NaN
142      NaN
143      NaN
144      NaN
...      ...
271111   NaN
271112   NaN
271113   NaN
271114   NaN
271115   NaN

[270976 rows x 11 columns]

In [23]:
# 2. Menggunakan iloc untuk slicing
subset_iloc = dataFrame.iloc[140:, 4:]

print(subset_iloc)

        Height  Weight      Team  NOC        Games  Year  Season  \
140      167.0    64.0     Spain  ESP  2016 Summer  2016  Summer
141      167.0    64.0     Spain  ESP  2016 Summer  2016  Summer
142      167.0    64.0     Spain  ESP  2016 Summer  2016  Summer
143      167.0    64.0     Spain  ESP  2016 Summer  2016  Summer
144      167.0    64.0     Spain  ESP  2016 Summer  2016  Summer
...        ...     ...       ...  ...          ...   ...     ...
271111   179.0    89.0  Poland-1  POL  1976 Winter  1976  Winter
271112   176.0    59.0    Poland  POL  2014 Winter  2014  Winter
271113   176.0    59.0    Poland  POL  2014 Winter  2014  Winter
271114   185.0    96.0    Poland  POL  1998 Winter  1998  Winter
271115   185.0    96.0    Poland  POL  2002 Winter  2002  Winter

                  City        Sport                                     Event  \
140     Rio de Janeiro   Gymnastics           Gymnastics Men's Floor Exercise
141     Rio de Janeiro   Gymnastics            Gymnastics Men's Parallel Bars
142     Rio de Janeiro   Gymnastics           Gymnastics Men's Horizontal Bar
143     Rio de Janeiro   Gymnastics                    Gymnastics Men's Rings
144     Rio de Janeiro   Gymnastics          Gymnastics Men's Pommelled Horse
...                ...          ...                                       ...
271111       Innsbruck         Luge                Luge Mixed (Men)'s Doubles
271112           Sochi  Ski Jumping  Ski Jumping Men's Large Hill, Individual
271113           Sochi  Ski Jumping        Ski Jumping Men's Large Hill, Team
271114          Nagano    Bobsleigh                      Bobsleigh Men's Four
271115  Salt Lake City    Bobsleigh                      Bobsleigh Men's Four

       Medal
140      NaN
141      NaN
142      NaN
143      NaN
144      NaN
...      ...
271111   NaN
271112   NaN
271113   NaN
271114   NaN
271115   NaN

[270976 rows x 11 columns]

5. **Mampilkan jumlah nilai dari semua attribute yang bernilai object**

In [25]:
# Filter hanya kolom bertipe objek
object_columns = dataFrame.select_dtypes(include=['object'])

# Iterasi melalui setiap kolom objek dan tampilkan jumlah nilai unik
for column in object_columns:
    value_counts = dataFrame[column].value_counts()
    print(f"Jumlah nilai untuk kolom '{column}': {len(value_counts)}")

Jumlah nilai untuk kolom 'Name': 134732
Jumlah nilai untuk kolom 'Sex': 2
Jumlah nilai untuk kolom 'Team': 1184
Jumlah nilai untuk kolom 'NOC': 230
Jumlah nilai untuk kolom 'Games': 51
Jumlah nilai untuk kolom 'Season': 2
Jumlah nilai untuk kolom 'City': 42
Jumlah nilai untuk kolom 'Sport': 66
Jumlah nilai untuk kolom 'Event': 765
Jumlah nilai untuk kolom 'Medal': 3